#!/usr/local/bin/ruby
require 'natto'

text = '　私は若い頃から、上司との面談などで、「あなたは、10年後どうなっていたいか？」などと聞かれたら、にっこり笑って「わかりません！」と答えていました。そして、その上司に、「私のどんなところが一番よいところですか？」と逆に聞いてみたりしていました。その時の答えがピンとくるかこないかで、その上司が私をよくわかってくれているか、信頼できるかがわかります。ピンとくれば、その信頼できる上司と一緒に自分のwillを形作っていくことができます。その目標に向かってさらに多くの強み＝canを手に入れられるよう、具体的な仕事＝mustが与えられていく。そのサイクルがビジネスでの私の成長を支え、確かな自信を作ってくれたように思います。'
text = "僕も結構学生さんと年間３００人くらいと会って話すとすごく分かるのが
この学生さんはすごく寂しい思いをしてきた人なんだなとか、
この学生さんは兄弟がいてすごくいい環境で育ってきたんだなとか
いろいろあるんですよ。それはどういうところで感じるかというと、
言葉の話をしているときに、相手がビビっとくるタイミングがあって
例えば、お金の事にすごく敏感な学生は、お金に対して困った経験とかがあったりとか。
たぶんそういう家庭環境がすべてなので、そこが自分の経験のベースになっているんじゃないかなと。

ー家庭環境というと田舎から上京してきてというのがあって、やはりローカルイノベーションって地方じゃないですか。
そういう田舎から出てきて無意識の味方をあぶってやるぞということは思ってるんですか？

そうですね。ローカルイノベーションっていう社名にしたのは理由としては３つあるんですけど、
１つ目は僕自身も地方の人間なので、そういう地方の人間が何かイノベーションを起こせるような人材派遣ができないか
というのを考えているのと、２つ目は、当時創業した時のメンバーは今はもういないんですけど、そのメンバーも長野と岩手だった
ので、結構地方メンバーが集まっているというのもあるんですけど、最後は、僕が描きたい未来は、みんな東京に来過ぎじゃないですか？

ー確かに

そうですよね。これから東京に来る人ってどんどん増えてくるけど、東京の物理的な地域って増えないじゃないですか？
埼玉を吸収して東京になるってありえないじゃないですか。物理的な範囲は広がらないのに、
人がどんどん増えてるんですよ。そうなった時に当然パンクするじゃないですか？笑

ー笑

じゃあそれをどう防ぐかっていうと、地方で活躍できる人材を輩出することが重要で、
僕も結構地方の学生の支援をしてるんですけど、無理矢理に地方に就職しろっていうのは僕は考えてなくて、
僕が描いている未来としては、なるべく東京の最先端の面白い会社に入って、
その能力と成長を培ったものを持ち帰って、地方で頑張るとか、地方でも出来る仕事に就くとかというふうに
やっていけば多分地方の人材も抱えていけると思っているので、そういう意味合いもあります。

ーキャリアセレクトが７割８割が地方の学生って聞いたんですけど、
やっぱり地方に重点を置いてこれからもやっていきたいということですか？

そうですね。そこの軸足はなるべくぶらさずにやっていきたいです。
後は、みんなの場合は理科大ですか？

ーみんな理科大です。

野田キャンパスとかですか？

ーみんな神楽坂です。

そうですか。神楽坂って超良いところだと思うんですよ。地方の大学ってそもそも行った事ないと思うんですけど、
まじで閉鎖的なんですよ。

ーそうですよね

だからすごい彼らって煮えたぎってるものがあるんですけどきっかけがなくて、
例えば、みんなだったら電車で３０分行けば色んな会える人がいたり、手に入ったりするじゃないですか。
彼らは例えば九州だったら飛行機を３万円４万円出してこっちまでこないといけないっていう投資をしないと行けないので
時間に対する価値が彼らは結構違ったりするんですけど。
なるべく、東京の学生は何もしなくても頑張れるだろって言うのがあって笑

ー笑

もちろんサポートはしていくんですけど、地方の学生の方が色んな制限とか制約があるので、
そういうのを気をつけたいなと思います。

ーここまでで工藤さんの考えが伝わってきてるんですけど、記事を書く上で強調したい事ってありますか？

僕の伝えたい事は、学生って何でもやっても良いと思うんですよ。何でもやっても良いし、色んな事に対して挑戦するのは
良いと思うんですけど、やりきったほうがいいですね。

ーやりきる・・・？？

足を入れようか入れないかちょっと触れて辞めるんじゃなくて、全部入れて・・・
例えばお湯があったとして、お湯の表面だけ触って「熱い」って感じて終わるんじゃなくて、
全部浸かってみて「熱いな」と感じたらやめたらいいし、「冷たいな」って出れば良いし、
でも、気持ちが良いなってなるかもしれないけど、
表面しか触ってないと基本的にどれくらい気持ちがいいかってわからないんですよ。
だから最後までちゃんと浸かってみてほしいんですよ。
何でもやってもいいけど、やり抜いてほしいしやり切ってほしい。

ーはい

で、やりきるための重要なヒントとしては、目標を決める事。

ー目標？はい。

個人的には、僕が学生のとき言われたのが、「夢と目標の違い何だと思う？」って言われて、
僕は当時は「夢って眠っててもかなえられるものですよね」って言ってたんですけど、
僕が教えてもらっていた先輩が言っていたのは、「違う」って言われて、「期限があるかないかなんだよって」
言われて「あ〜」と思ったんですよ。例えば世界一周旅行したいって思うじゃないですか。いずれしたい。これは夢じゃないですか。
でも、これを４０歳までにしたいってなった時に期限が設定されるので、そこに対してかかる費用は何なのかとか
どこに行きたいのかとか計画が生まれるじゃないですか。

ーはい

それが結果的に計画が生まれ実行されるとその夢が形になるんですよ。
そういうところを学生さんも少しでも意識して動くと、１年後２年後の自分ってものすごく
大きく感じると思うので、そういうところを伝えたいですね。


ー夢と目標を混同しないで、しっかり目標を持って、自分で掲げた目標をやりきってほしいということですね。

後は、周りからどう思われてもあまり気にしなくていいと思いますよ。
自分のしたい事をとことんやり抜いた方が良いと思いますね。
なんかこれやってておかしいんじゃないかとか言われても自分自身の目標をやり抜いてほしいと思いますね。

ー自分自身の目標をしっかり完成するといったことですね

馬鹿なんじゃないの？って思われても、それは現時点においては馬鹿かもしれないけど
１年後になったらそれが当たり前になるかもしれないし、逆に言ったら
このコミュニティだったら否定されるかもしれないけど
違うコミュニティだったらものすごく賞賛されることかもしれないので、
そういうのが周りの意見とかを気にしちゃうと結構できないので、
自分が立てた目標だったら、それを貫いた方が良いと思います。

ーはい。これ聞いたの良かったね。誰に聞いてもすばらしい話頂けて。

ー僕は地方でハッカソンをやりたいなと思ってるんですけど、僕地元八丈島なんですけど、ぜひやりたいなと思ってて笑

エンジニア八丈島にいますか？笑

ーいや、東京からエンジニアを連れてくるっていう形で

なるほどね。そこを連れてってやると。八丈島をIT化したい？

ーちょっと笑

八丈島って伊豆諸島のうちの１つ？

ーそうですね

何キロくらい？

ー東京から３００キロくらいですね。僕以外みんなローカルじゃないんですけど笑

でもなんか面白いですね。そういうのも。

ー船の会社の人に言えば多分半額くらいにはしてくれるので。

でもそういうの面白いと思います。企画うまく立てれば面白い企画になると思います。
八丈島でハッカソンとか八丈島で何かイベントをするというのは面白いと思います。

ーなんかいつか八丈島でサテライトオフィスとか逆に地方で会社を開きたいなと考えてるんですけど

いいじゃないですか

ーどうなんですかね？？
東京に人集まりすぎるじゃないですか。

ー逆に会社が地方に行ってていうのは現実的じゃないですかね？

でも、それは今の時代であればそういう動きがあって、
例えば皆さん知らないかもしれないけど、
徳島県とかっていうのは基本的にすごくIT企業を推奨している県なんですよ。

ーへぇ〜

IT企業のサテライトオフィスってすごくあって、例えば最近皆さん使っているか分からないんですけど、
アプリで「Eight」っていうのがあって・・・・

ー名刺のアプリですよね？

そうです。それが、徳島県でサテライトオフィスを設けててそこでエンジニアたちが開発してるんですけど、
なぜそれができるかというと、いわゆるITってパソコン一台と通信環境があれば開発って出来るじゃないですか。
それって別にどこで仕事をしてても出来ることなんですよ。そういう傾向って結構今進んでて、今の時代だったら
そういうのもできるんですよ。

ー地方でやりたいなーと思ってるんですよ

ー最近だからこそ対面でなくても形ないものを売れるようになったので、
地方でくすぶっている人を使って仕事ができるようになったということでしょうか

そうですね。あと会いやすくなりましたよね人とも。インターネットもこれだけ普及してるので。
だから、企業の採用も変わってきてますよ。
皆さんが就職活動する２年ごとか就職の活動の仕方も変わってると思いますよ。
たぶん２３年でスカイプ面接って当たり前になってるんですよ。
企業によっては最終面接の一歩手前までスカイプ面接でOKっていうところがあるんですよ。

ーはい

というのが普通のIT企業上場企業でやってる事なので、もっと頃これから当たり前以上のものになるので、
多分色んなデバイスを使って地方で設けられるようになると思います。

ー地方活性化したいですね。ローカルイノベーションしましょう！

ー質問しても良いですか？工藤さんはプログラミングの勉強はしてきましたか？
言語とかのところまで入ってなくて、HTMLとか箱の仕事をし始めてから始めました。

ーローカルイノベーションのホームページを作るとき？

いや、それは完全に自社のエンジニアがやっているので、自分が普通に勉強でやってる感じですね。
うちのメンバーは結構やっている人多くて、コードとかも自分で勉強したり。
それって結構学生と話す時、情報理工の学生とかでプログラミングの考え方ってやってないとその気持ちがわからないじゃないですか。
少しでも理解しようとするとある程度エディターを見たりしようと思ってます。

ーじゃあ抜き打ちで言語を学ぼうと思います！

すごい大事なのは、今の時代はただコードを書ける人というのは淘汰されていくと考えられていて、
このやってる内容が事業にどう役に立つかとかサービスにどういう風に付加価値は与えられるか
という側面を持って皆さんもやって行くと、ものすごく価値あるエンジニアになると思います。

例えば、職種としてなくなると言われてるのは弁護士とか税理士とか、何かPCにインプットすれば
すぐに出てくる作業は淘汰されると言われているので、
これからの時代は僕の極論なんですけど、英語喋れなくていいと思ってて
どうしてかというと同時通訳できるものというのは１００％現れてくるので、
それを作れる側の人間になった方が僕は賢いと思います。

あとはアルゴリズムを学んだりとか、その仕組みを学ばなければならないじゃないですか。
僕は英語を喋れる事はこれからの時代大事だと思わなくて翻訳機能をリアルタイムで開発
できる人がすごいと思います。
そしたら、稼げますよ。

ーこれからの時代をただプログラムを組むだけでなく、プログラムを組む知識を得た上で、
どんなサービスが出来るかというその段階が重要になってくるという事ですか？

大事ですね。そういう意識を持って開発したらすごい伸びると思うんですよ。

就職活動する時に必ず１００％聞かれるのは、
「あなた今まで何やりました？」「これやりました？」「なぜこれやったの？」
って聞かれるんですよ。
なぜってことがしっかり言えるじゃないですか。
こういう問題があり、それを解決するためにこういうことをやりました。
という風に１００％回答できるんで。

そういう考え方持っておくと周りが見られるようになるんですよ。
そういう考え方持っておくと周りが見られるようになるんですよ。
そういう考え方持っておくと周りが見られるようになるんですよ。

この学生さんはすごく寂しい思いをしてきた人なんだなとか、
この学生さんは兄弟がいてすごくいい環境で育ってきたんだなとか
いろいろあるんですよ。それはどういうところで感じるかというと、
言葉の話をしているときに、相手がビビっとくるタイミングがあって
例えば、お金の事にすごく敏感な学生は、お金に対して困った経験とかがあったりとか。
たぶんそういう家庭環境がすべてなので、そこが自分の経験のベースになっているんじゃないかなと。

ー家庭環境というと田舎から上京してきてというのがあって、やはりローカルイノベーションって地方じゃないですか。
そういう田舎から出てきて無意識の味方をあぶってやるぞということは思ってるんですか？

そうですね。ローカルイノベーションっていう社名にしたのは理由としては３つあるんですけど、
１つ目は僕自身も地方の人間なので、そういう地方の人間が何かイノベーションを起こせるような人材派遣ができないか
というのを考えているのと、２つ目は、当時創業した時のメンバーは今はもういないんですけど、そのメンバーも長野と岩手だった
ので、結構地方メンバーが集まっているというのもあるんですけど、最後は、僕が描きたい未来は、みんな東京に来過ぎじゃないですか？

ー確かに

そうですよね。これから東京に来る人ってどんどん増えてくるけど、東京の物理的な地域って増えないじゃないですか？
埼玉を吸収して東京になるってありえないじゃないですか。物理的な範囲は広がらないのに、
人がどんどん増えてるんですよ。そうなった時に当然パンクするじゃないですか？笑

ー笑

じゃあそれをどう防ぐかっていうと、地方で活躍できる人材を輩出することが重要で、
僕も結構地方の学生の支援をしてるんですけど、無理矢理に地方に就職しろっていうのは僕は考えてなくて、
僕が描いている未来としては、なるべく東京の最先端の面白い会社に入って、
その能力と成長を培ったものを持ち帰って、地方で頑張るとか、地方でも出来る仕事に就くとかというふうに
やっていけば多分地方の人材も抱えていけると思っているので、そういう意味合いもあります。

ーキャリアセレクトが７割８割が地方の学生って聞いたんですけど、
やっぱり地方に重点を置いてこれからもやっていきたいということですか？

そうですね。そこの軸足はなるべくぶらさずにやっていきたいです。
後は、みんなの場合は理科大ですか？

ーみんな理科大です。

野田キャンパスとかですか？

ーみんな神楽坂です。

そうですか。神楽坂って超良いところだと思うんですよ。地方の大学ってそもそも行った事ないと思うんですけど、
まじで閉鎖的なんですよ。

ーそうですよね

だからすごい彼らって煮えたぎってるものがあるんですけどきっかけがなくて、
例えば、みんなだったら電車で３０分行けば色んな会える人がいたり、手に入ったりするじゃないですか。
彼らは例えば九州だったら飛行機を３万円４万円出してこっちまでこないといけないっていう投資をしないと行けないので
時間に対する価値が彼らは結構違ったりするんですけど。
なるべく、東京の学生は何もしなくても頑張れるだろって言うのがあって笑

ー笑

もちろんサポートはしていくんですけど、地方の学生の方が色んな制限とか制約があるので、
そういうのを気をつけたいなと思います。

ーここまでで工藤さんの考えが伝わってきてるんですけど、記事を書く上で強調したい事ってありますか？

僕の伝えたい事は、学生って何でもやっても良いと思うんですよ。何でもやっても良いし、色んな事に対して挑戦するのは
良いと思うんですけど、やりきったほうがいいですね。

ーやりきる・・・？？

足を入れようか入れないかちょっと触れて辞めるんじゃなくて、全部入れて・・・
例えばお湯があったとして、お湯の表面だけ触って「熱い」って感じて終わるんじゃなくて、
全部浸かってみて「熱いな」と感じたらやめたらいいし、「冷たいな」って出れば良いし、
でも、気持ちが良いなってなるかもしれないけど、
表面しか触ってないと基本的にどれくらい気持ちがいいかってわからないんですよ。
だから最後までちゃんと浸かってみてほしいんですよ。
何でもやってもいいけど、やり抜いてほしいしやり切ってほしい。

ーはい

で、やりきるための重要なヒントとしては、目標を決める事。

ー目標？はい。

個人的には、僕が学生のとき言われたのが、「夢と目標の違い何だと思う？」って言われて、
僕は当時は「夢って眠っててもかなえられるものですよね」って言ってたんですけど、
僕が教えてもらっていた先輩が言っていたのは、「違う」って言われて、「期限があるかないかなんだよって」
言われて「あ〜」と思ったんですよ。例えば世界一周旅行したいって思うじゃないですか。いずれしたい。これは夢じゃないですか。
でも、これを４０歳までにしたいってなった時に期限が設定されるので、そこに対してかかる費用は何なのかとか
どこに行きたいのかとか計画が生まれるじゃないですか。

ーはい

それが結果的に計画が生まれ実行されるとその夢が形になるんですよ。
そういうところを学生さんも少しでも意識して動くと、１年後２年後の自分ってものすごく
大きく感じると思うので、そういうところを伝えたいですね。


ー夢と目標を混同しないで、しっかり目標を持って、自分で掲げた目標をやりきってほしいということですね。

後は、周りからどう思われてもあまり気にしなくていいと思いますよ。
自分のしたい事をとことんやり抜いた方が良いと思いますね。
なんかこれやってておかしいんじゃないかとか言われても自分自身の目標をやり抜いてほしいと思いますね。

ー自分自身の目標をしっかり完成するといったことですね

馬鹿なんじゃないの？って思われても、それは現時点においては馬鹿かもしれないけど
１年後になったらそれが当たり前になるかもしれないし、逆に言ったら
このコミュニティだったら否定されるかもしれないけど
違うコミュニティだったらものすごく賞賛されることかもしれないので、
そういうのが周りの意見とかを気にしちゃうと結構できないので、
自分が立てた目標だったら、それを貫いた方が良いと思います。

ーはい。これ聞いたの良かったね。誰に聞いてもすばらしい話頂けて。

ー僕は地方でハッカソンをやりたいなと思ってるんですけど、僕地元八丈島なんですけど、ぜひやりたいなと思ってて笑

エンジニア八丈島にいますか？笑

ーいや、東京からエンジニアを連れてくるっていう形で

なるほどね。そこを連れてってやると。八丈島をIT化したい？

ーちょっと笑

八丈島って伊豆諸島のうちの１つ？

ーそうですね

何キロくらい？

ー東京から３００キロくらいですね。僕以外みんなローカルじゃないんですけど笑

でもなんか面白いですね。そういうのも。

ー船の会社の人に言えば多分半額くらいにはしてくれるので。

でもそういうの面白いと思います。企画うまく立てれば面白い企画になると思います。
八丈島でハッカソンとか八丈島で何かイベントをするというのは面白いと思います。

ーなんかいつか八丈島でサテライトオフィスとか逆に地方で会社を開きたいなと考えてるんですけど

いいじゃないですか

ーどうなんですかね？？
東京に人集まりすぎるじゃないですか。

ー逆に会社が地方に行ってていうのは現実的じゃないですかね？

でも、それは今の時代であればそういう動きがあって、
例えば皆さん知らないかもしれないけど、
徳島県とかっていうのは基本的にすごくIT企業を推奨している県なんですよ。

ーへぇ〜

IT企業のサテライトオフィスってすごくあって、例えば最近皆さん使っているか分からないんですけど、
アプリで「Eight」っていうのがあって・・・・

ー名刺のアプリですよね？

そうです。それが、徳島県でサテライトオフィスを設けててそこでエンジニアたちが開発してるんですけど、
なぜそれができるかというと、いわゆるITってパソコン一台と通信環境があれば開発って出来るじゃないですか。
それって別にどこで仕事をしてても出来ることなんですよ。そういう傾向って結構今進んでて、今の時代だったら
そういうのもできるんですよ。

ー地方でやりたいなーと思ってるんですよ

ー最近だからこそ対面でなくても形ないものを売れるようになったので、
地方でくすぶっている人を使って仕事ができるようになったということでしょうか

そうですね。あと会いやすくなりましたよね人とも。インターネットもこれだけ普及してるので。
だから、企業の採用も変わってきてますよ。
皆さんが就職活動する２年ごとか就職の活動の仕方も変わってると思いますよ。
たぶん２３年でスカイプ面接って当たり前になってるんですよ。
企業によっては最終面接の一歩手前までスカイプ面接でOKっていうところがあるんですよ。

ーはい

というのが普通のIT企業上場企業でやってる事なので、もっと頃これから当たり前以上のものになるので、
多分色んなデバイスを使って地方で設けられるようになると思います。

ー地方活性化したいですね。ローカルイノベーションしましょう！

ー質問しても良いですか？工藤さんはプログラミングの勉強はしてきましたか？
言語とかのところまで入ってなくて、HTMLとか箱の仕事をし始めてから始めました。

ーローカルイノベーションのホームページを作るとき？

いや、それは完全に自社のエンジニアがやっているので、自分が普通に勉強でやってる感じですね。
うちのメンバーは結構やっている人多くて、コードとかも自分で勉強したり。
それって結構学生と話す時、情報理工の学生とかでプログラミングの考え方ってやってないとその気持ちがわからないじゃないですか。
少しでも理解しようとするとある程度エディターを見たりしようと思ってます。

ーじゃあ抜き打ちで言語を学ぼうと思います！

すごい大事なのは、今の時代はただコードを書ける人というのは淘汰されていくと考えられていて、
このやってる内容が事業にどう役に立つかとかサービスにどういう風に付加価値は与えられるか
という側面を持って皆さんもやって行くと、ものすごく価値あるエンジニアになると思います。

例えば、職種としてなくなると言われてるのは弁護士とか税理士とか、何かPCにインプットすれば
すぐに出てくる作業は淘汰されると言われているので、
これからの時代は僕の極論なんですけど、英語喋れなくていいと思ってて
どうしてかというと同時通訳できるものというのは１００％現れてくるので、
それを作れる側の人間になった方が僕は賢いと思います。

あとはアルゴリズムを学んだりとか、その仕組みを学ばなければならないじゃないですか。
僕は英語を喋れる事はこれからの時代大事だと思わなくて翻訳機能をリアルタイムで開発
できる人がすごいと思います。
そしたら、稼げますよ。

ーこれからの時代をただプログラムを組むだけでなく、プログラムを組む知識を得た上で、
どんなサービスが出来るかというその段階が重要になってくるという事ですか？

大事ですね。そういう意識を持って開発したらすごい伸びると思うんですよ。

就職活動する時に必ず１００％聞かれるのは、
「あなた今まで何やりました？」「これやりました？」「なぜこれやったの？」
って聞かれるんですよ。
なぜってことがしっかり言えるじゃないですか。
こういう問題があり、それを解決するためにこういうことをやりました。
という風に１００％回答できるんで。

そういう考え方持っておくと周りが見られるようになるんですよ。
そういう考え方持っておくと周りが見られるようになるんですよ。
この学生さんはすごく寂しい思いをしてきた人なんだなとか、
この学生さんは兄弟がいてすごくいい環境で育ってきたんだなとか
いろいろあるんですよ。それはどういうところで感じるかというと、
言葉の話をしているときに、相手がビビっとくるタイミングがあって
例えば、お金の事にすごく敏感な学生は、お金に対して困った経験とかがあったりとか。
たぶんそういう家庭環境がすべてなので、そこが自分の経験のベースになっているんじゃないかなと。

ー家庭環境というと田舎から上京してきてというのがあって、やはりローカルイノベーションって地方じゃないですか。
そういう田舎から出てきて無意識の味方をあぶってやるぞということは思ってるんですか？

そうですね。ローカルイノベーションっていう社名にしたのは理由としては３つあるんですけど、
１つ目は僕自身も地方の人間なので、そういう地方の人間が何かイノベーションを起こせるような人材派遣ができないか
というのを考えているのと、２つ目は、当時創業した時のメンバーは今はもういないんですけど、そのメンバーも長野と岩手だった
ので、結構地方メンバーが集まっているというのもあるんですけど、最後は、僕が描きたい未来は、みんな東京に来過ぎじゃないですか？

ー確かに

そうですよね。これから東京に来る人ってどんどん増えてくるけど、東京の物理的な地域って増えないじゃないですか？
埼玉を吸収して東京になるってありえないじゃないですか。物理的な範囲は広がらないのに、
人がどんどん増えてるんですよ。そうなった時に当然パンクするじゃないですか？笑

ー笑

じゃあそれをどう防ぐかっていうと、地方で活躍できる人材を輩出することが重要で、
僕も結構地方の学生の支援をしてるんですけど、無理矢理に地方に就職しろっていうのは僕は考えてなくて、
僕が描いている未来としては、なるべく東京の最先端の面白い会社に入って、
その能力と成長を培ったものを持ち帰って、地方で頑張るとか、地方でも出来る仕事に就くとかというふうに
やっていけば多分地方の人材も抱えていけると思っているので、そういう意味合いもあります。

ーキャリアセレクトが７割８割が地方の学生って聞いたんですけど、
やっぱり地方に重点を置いてこれからもやっていきたいということですか？

そうですね。そこの軸足はなるべくぶらさずにやっていきたいです。
後は、みんなの場合は理科大ですか？


後は、周りからどう思われてもあまり気にしなくていいと思いますよ。
自分のしたい事をとことんやり抜いた方が良いと思いますね。
なんかこれやってておかしいんじゃないかとか言われても自分自身の目標をやり抜いてほしいと思いますね。

ー自分自身の目標をしっかり完成するといったことですね

馬鹿なんじゃないの？って思われても、それは現時点においては馬鹿かもしれないけど
１年後になったらそれが当たり前になるかもしれないし、逆に言ったら
このコミュニティだったら否定されるかもしれないけど
違うコミュニティだったらものすごく賞賛されることかもしれないので、
そういうのが周りの意見とかを気にしちゃうと結構できないので、
自分が立てた目標だったら、それを貫いた方が良いと思います。

ーはい。これ聞いたの良かったね。誰に聞いてもすばらしい話頂けて。

ー僕は地方でハッカソンをやりたいなと思ってるんですけど、僕地元八丈島なんですけど、ぜひやりたいなと思ってて笑

エンジニア八丈島にいますか？笑

ーいや、東京からエンジニアを連れてくるっていう形で

なるほどね。そこを連れてってやると。八丈島をIT化したい？

ーちょっと笑

八丈島って伊豆諸島のうちの１つ？

ーそうですね

何キロくらい？

ー東京から３００キロくらいですね。僕以外みんなローカルじゃないんですけど笑

でもなんか面白いですね。そういうのも。

ー船の会社の人に言えば多分半額くらいにはしてくれるので。

でもそういうの面白いと思います。企画うまく立てれば面白い企画になると思います。
八丈島でハッカソンとか八丈島で何かイベントをするというのは面白いと思います。

ーなんかいつか八丈島でサテライトオフィスとか逆に地方で会社を開きたいなと考えてるんですけど

いいじゃないですか

ーどうなんですかね？？
東京に人集まりすぎるじゃないですか。

ー逆に会社が地方に行ってていうのは現実的じゃないですかね？

でも、それは今の時代であればそういう動きがあって、
例えば皆さん知らないかもしれないけど、
徳島県とかっていうのは基本的にすごくIT企業を推奨している県なんですよ。

ーへぇ〜

IT企業のサテライトオフィスってすごくあって、例えば最近皆さん使っているか分からないんですけど、
アプリで「Eight」っていうのがあって・・・・

ー名刺のアプリですよね？

そうです。それが、徳島県でサテライトオフィスを設けててそこでエンジニアたちが開発してるんですけど、
なぜそれができるかというと、いわゆるITってパソコン一台と通信環境があれば開発って出来るじゃないですか。
それって別にどこで仕事をしてても出来ることなんですよ。そういう傾向って結構今進んでて、今の時代だったら
そういうのもできるんですよ。

ー地方でやりたいなーと思ってるんですよ

ー最近だからこそ対面でなくても形ないものを売れるようになったので、
地方でくすぶっている人を使って仕事ができるようになったということでしょうか

そうですね。あと会いやすくなりましたよね人とも。インターネットもこれだけ普及してるので。
だから、企業の採用も変わってきてますよ。
皆さんが就職活動する２年ごとか就職の活動の仕方も変わってると思いますよ。
たぶん２３年でスカイプ面接って当たり前になってるんですよ。
企業によっては最終面接の一歩手前までスカイプ面接でOKっていうところがあるんですよ。

ーはい

というのが普通のIT企業上場企業でやってる事なので、もっと頃これから当たり前以上のものになるので、
多分色んなデバイスを使って地方で設けられるようになると思います。

ー地方活性化したいですね。ローカルイノベーションしましょう！



"
natto = Natto::MeCab.new




natto.parse(text) do |n|
origin =n.surface

if origin != ""

num=n.feature.split(',').count
num2=n.surface.split(',').count
if(num>7)
    kana=n.feature.split(',')[7].tr("ァ-ン","ぁ-ん")
else
  kana=origin
end

if origin == kana
  print n.surface


else





num=kana.split(//).count
num2=origin.split(//).count

a=kana.split(//)
b=origin.split(//)



if  a[num-1]==b[num2-1] && a[num-2]==b[num2-2]




a[num-1]=""
a[num-2]=""
kana=""
for c in a
kana+=c
end
end


if  a[num-1]==b[num2-1]
a[num-1]=""
kana=""
check=1
for c in a
kana+=c
end
end





  print "<ruby><rb>#{n.surface}<rb><rt>#{kana}</rt></ruby>"
end
end
end
